Service - Payday Filing/Employee Details/Archive/20180809/RetrieveList.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
xmlns:emp="https://services.ird.govt.nz/GWS/Employment/"
xmlns:ret="https://services.ird.govt.nz/GWS/Employment/:types/RetrieveListRequest"
xmlns:a="http://www.w3.org/2005/08/addressing">
   <soap:Header>
   </soap:Header>
   <soap:Body>
      <emp:RetrieveList>
         <emp:RetrieveListRequestMsg>
            <ret:RetrieveListRequestWrapper>
               <empl:retrieveListRequest
               xmlns:empl="urn:www.ird.govt.nz/GWS:types/Employment"
               xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v1">
               <empl:header>
					<cmn:softwareProviderData>
						<cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
						<cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
						<cmn:softwareRelease>1</cmn:softwareRelease>
					</cmn:softwareProviderData>
					<cmn:identifier IdentifierValueType="ACCIRD">123123123</cmn:identifier>
					<cmn:accountType>PSO</cmn:accountType>
				</empl:header>
				<empl:retrieveListBody>
				    <!--Optional-->
					<!--<empl:employeeIRD>031032024</empl:employeeIRD>-->
				</empl:retrieveListBody>
               </empl:retrieveListRequest>
            </ret:RetrieveListRequestWrapper>
         </emp:RetrieveListRequestMsg>
      </emp:RetrieveList>
   </soap:Body>
</soap:Envelope>
